devdnl/dnx-rtos/src/system/drivers/irq/stm32f1/irq.c
        device_stat->st_size  = 0;
        device_stat->st_major = _IRQ_MAJOR_NUMBER;
        device_stat->st_minor = _IRQ_MINOR_NUMBER;

        return ESUCC;
}

//==============================================================================
/**
 * @brief Converts EXTI IRQ number (0-15) to NVIC IRQ number
 *
 * @param EXTI_IRQ_n    EXTI IRQ number
 *
 * @return On success, NVIC IRQ number is returned, otherwise 0.
 */
//==============================================================================
static enum IRQn EXTI_IRQ_number_to_NVIC_IRQn(uint EXTI_IRQ_n)
{
        switch (EXTI_IRQ_n) {
        case 0  ... 4 : return EXTI0_IRQn + EXTI_IRQ_n;
        case 5  ... 9 : return EXTI9_5_IRQn;
        case 10 ... 15: return EXTI15_10_IRQn;
        default:        return 0;
        }
}

//==============================================================================
/**
 * @brief Function enable or disable selected EXTI interrupt
 *
 * @param EXTI_IRQ_n    EXTI IRQ number (0-15)
 * @param state         new interrupt state
 *
 * @return None
 */
//==============================================================================
static void change_EXTI_IRQ_state(uint EXTI_IRQ_n, bool state)
{
        enum IRQn IRQn = EXTI_IRQ_number_to_NVIC_IRQn(EXTI_IRQ_n);

        if (IRQn != 0) {
                if (state) {
                        SET_BIT(EXTI->IMR, EXTI_IMR_MR0 << EXTI_IRQ_n);
                        SET_BIT(EXTI->EMR, EXTI_EMR_MR0 << EXTI_IRQ_n);
                        NVIC_EnableIRQ(IRQn);
                } else {
                        CLEAR_BIT(EXTI->IMR, EXTI_IMR_MR0 << EXTI_IRQ_n);
                        CLEAR_BIT(EXTI->EMR, EXTI_EMR_MR0 << EXTI_IRQ_n);

                        switch (IRQn) {
                        case EXTI9_5_IRQn: {
                                static const u32_t IRQ9_5_mask = EXTI_IMR_MR5
                                                               | EXTI_IMR_MR6
                                                               | EXTI_IMR_MR7
                                                               | EXTI_IMR_MR8
                                                               | EXTI_IMR_MR9;

                                if ((EXTI->IMR & IRQ9_5_mask) == 0) {
                                        NVIC_DisableIRQ(IRQn);
                                }
                                break;
                        }

                        case EXTI15_10_IRQn: {
                                static const u32_t IRQ15_10_mask = EXTI_IMR_MR10
                                                                 | EXTI_IMR_MR11
                                                                 | EXTI_IMR_MR12
                                                                 | EXTI_IMR_MR13
                                                                 | EXTI_IMR_MR14
                                                                 | EXTI_IMR_MR15;

                                if ((EXTI->IMR & IRQ15_10_mask) == 0) {
                                        NVIC_DisableIRQ(IRQn);
                                }
                                break;
                        }

                        default:
                                NVIC_DisableIRQ(IRQn);
                                break;
                        }

                }
        }
}

//==============================================================================
/**
 * @brief Function changes selected EXTI priority
 *
 * @param EXTI_IRQ_n    EXTI IRQ number
 * @param prio          new interrupt priority
 *
 * @return None
 */
//==============================================================================
static void set_EXTI_IRQ_priority(uint EXTI_IRQ_n, u32_t priority)
{
        enum IRQn IRQn = EXTI_IRQ_number_to_NVIC_IRQn(EXTI_IRQ_n);

        if (IRQn != 0) {
                NVIC_SetPriority(IRQn, priority);
        }
}

//==============================================================================
/**
 * @brief Changes interrupt detector sensitivity
 *
 * @param EXTI_IRQ_n    EXTI IRQ number
 * @param falling       interrupt triggered on falling edge
 * @param rising        interrupt triggered on rising edge
 *
 * @return None
 */
//==============================================================================
static void set_EXTI_edge_detector(uint EXTI_IRQ_n, bool falling, bool rising)
{
        if (EXTI_IRQ_n < NUMBER_OF_IRQs) {
                if (falling) {
                        SET_BIT(EXTI->FTSR, EXTI_FTSR_TR0 << EXTI_IRQ_n);
                } else {
                        CLEAR_BIT(EXTI->FTSR, EXTI_FTSR_TR0 << EXTI_IRQ_n);
                }

                if (rising) {
                        SET_BIT(EXTI->RTSR, EXTI_RTSR_TR0 << EXTI_IRQ_n);
                } else {
                        CLEAR_BIT(EXTI->RTSR, EXTI_RTSR_TR0 << EXTI_IRQ_n);
                }
        }
}

//==============================================================================
/**
 * @brief Disables selected EXTI interrupt
 *
 * @param EXTI_IRQ_n    EXTI IRQ number
 *
 * @return None
 */
//==============================================================================
static inline void disable_EXTI_IRQ(uint EXTI_IRQ_n)
{
        change_EXTI_IRQ_state(EXTI_IRQ_n, false);
}

//==============================================================================
/**
 * @brief Enables selected EXTI interrupt
 *
 * @param EXTI_IRQ_n    EXTI IRQ number
 *
 * @return None
 */
//==============================================================================
static inline void enable_EXTI_IRQ(uint EXTI_IRQ_n)
{
        change_EXTI_IRQ_state(EXTI_IRQ_n, true);
}

//==============================================================================
/**
 * @brief Handle interrupts for selected EXTI line
 *
 * @param EXTI_IRQ_n    EXTI IRQ number
 *
 * @return true if task woken, otherwise false
 */
//==============================================================================
static bool IRQ_handler(uint EXIT_IRQ_n)
{
        WRITE_REG(EXTI->PR, EXTI_PR_PR0 << EXIT_IRQ_n);

        if (IRQ == NULL) {
                return false;
        }

